Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Any Regex pattern match $a =~ /$b/
es_es: Cualquiera Regex coincidencia de patrones $a =~ /$b/

source: Here's a declaration of the array:
es_es: Aquí hay una declaración del array:

source: See L<perlretut/"Using regular expressions in Perl"> for further explanation of the g and c modifiers.
es_es: Vea L<perlretut/"Usando expresiones regulares en Perl"> para una explicación más detallada de los modificadores g y c.

source: =item warn LIST X<warn> X<warning> X<STDERR>
es_es: =item warn LISTA X<warn> X<warning> X<STDERR> X<avisos>

source: C<sprintf "%u", -1> therefore provides the same result as C<sprintf "%u", ~0>.
es_es: Así, C<sprintf "%u", -1> produce el mismo resultado que C<sprintf "%u", ~0>.

source: These examples of the whatever operator are still syntax errors:
es_es: Estos ejemplos del operador lo-que-sea siguen siendo errores de sintaxis:

source: This is often useful if you need to check the current Perl version before C<use>ing library modules that won't work with older versions of Perl.
es_es: Suele ser útil si necesita comprobar la versión actual de Perl antes de que C<use> módulos que no funcionarán con versiones anteriores de Perl.

source: No Configure is needed to build microperl, on the other hand this means that interfaces between Perl and your operating system are left very -- minimal.
es_es: No se necesita Configure para construir microperl, por otra parte esto significa que las interfaces entre Perl y su sistema operativo se quedan en muy, muy, muy mínimas.

source: There is a bug in FreeBSD's C<readdir_r> function in versions 4.5 and earlier that can cause a SEGV when reading large directories.
es_es: Hay un bug en la función C<readdir_r> de FreeBSD en la versión 4.5 y anteriores que pueden provocar un SEGV al leer grandes directorios.

source: =head2 Files and I/O
es_es: =head2 Archivos y E/S

source: perl5122delta Perl changes in version 5.12.2
es_es: perl5122delta Cambios en la versión 5.12.2

source: For more details and discussion on the latter, see:
es_es: Para obtener más detalles y discusión sobre esto último, vea:

source: Note that C<err> low-precedence defined-or operator used to be enabled by default (although as a weak keyword, meaning that any function would override it).
es_es: Tenga en cuenta que, por defecto, C<err> activa un nivel bajo de precedencia con el operador defined-or (aunque, como palabra clave débil, lo que significa que cualquier función puede sobreescribirla).

source: =head2 Free (as in beer) books
es_es: =head2 Libros gratuitos

source: X<string, concatenation> X<concatenation> X<cat> X<concat> X<concatenate> X<.>
es_es: X<string, concatenation> X<concatenation> X<cat> X<concat> X<concatenate> X<.> X<cadena> X<concatenación> X<concatenar>

source: %u an unsigned integer, in decimal
es_es: %u un entero sin signo, en decimal

source: printf '%2$d %1$d', 12, 34; # prints "34 12"
es_es: printf '%2$d %1$d', 12, 34; # imprime "34 12"

source: However, OO Perl is largely beyond the scope of this document.
es_es: Sin embargo, este tema queda fuera del ámbito de este documento.

source: ISBN 1-930110-82-0 [1st edition August 2002]
es_es: ISBN 1-930110-82-0 [1ª edición - Agosto de 2002]

source: # no compile-time or run-time warnings before here
es_es: # no advertencias en compilación o ejecución antes de aquí

source: Perl 5.7/8.x for DG/UX ix86 R4.20MU0x
es_es: Perl 5.7/8.x para DG/UX ix86 R4.20MU0x

source: In the opposite way, to resolve a hostname to the IP address you can write this:
es_es: En sentido contrario, para resolver un nombre de host a la dirección IP puede escribir lo siguiente:

source: Here's an example:
es_es: Aquí hay un ejemplo:

source: The null list is represented by ().
es_es: La lista nula se representa por ().

source: Such discretionary locks are more flexible, but offer fewer guarantees.
es_es: Tales bloqueos, discrecionalmente, son más flexibles, pero ofrecen pocas garantías.

source: This makes it nice for initializing hashes:
es_es: Esto hace que sea algo agradable para inicializar los hashes:

source: print 102.111.111; # same
es_es: print 102.111.111; # lo mismo

source: =head2 Task-Oriented
es_es: =head2 Libros orientados a tareas específicas

# print 'p N$' ^ " E<H "; # prints "Perl ";
source: print 'p N$' ^ " E<H\n"; # prints "Perl\n";
es_es: print 'p N$' ^ " E<H\n"; # imprime "Perl\n";

source: Using the sprintf() function with some formats could lead to a buffer overflow in some specific cases.
es_es: Usando la función sprintf() con algunos formatos podría dar lugar a un desbordamiento de búfer, en algunos casos específicos.

source: When C<$/> is set to C<undef>, when C<readline> is in scalar context (i.e., file slurp mode), and when an empty file is read, it returns C<''> the first time, followed by C<undef> subsequently.
es_es: Cuando C<$/> tenga un valor de C<undef>, cuando C<readline> esté en contexto escalar (es decir, modo de absorción completa de archivo), y cuando se esté leyendo un archivo vacío, devuelve C<''> la primera vez, seguido a continuación de C<undef>.

source: The exception to this is when writing files that should be kept private: mail files, web browser cookies, I<.rhosts> files, and so on.
es_es: La excepción a esto es cuando se escriben archivos que deben mantenerse de forma privada: archivos de correo, los cookies del navegador web, archivos I<rhosts>, y así sucesivamente.

source: If they happen to be in the same package, Perl will emit warnings if you have asked for them, just like multiple C<my> declarations.
es_es: Si están en el mismo paquete, Perl emitirá mensajes de advertencia si los tiene activados, al igual que múltiples declaraciones de C<my>.

source: Binary ".." is the range operator, which is really two different operators depending on the context.
es_es: Binario ".." es el operador rango, que en realidad son dos operadores diferentes en función del contexto.

# for (1..15) { print "Merry Christmas "; }
source: for (1..15) { print "Merry Christmas\n"; }
es_es: for (1..15) { print "Feliz Navidad\n"; }

source: # We must also take care of not escaping the legitimate \\Y|
es_es: # También hay que tener cuidado de no escapar la legítima

source: The four-argument form of select() did not preserve $!
es_es: La forma de cuatro argumentos de select() no preservaba $!

source: Hence this change will not have any affect once perl is installed.
es_es: Por lo tanto, este cambio no tendrá ningún efecto una vez se haya instalado perl.

source: This includes the C<STORABLE_attach> hook functionality added by Adam Kennedy, and more frugal memory requirements when storing under C<ithreads>, by using the C<ithreads> cloning tracking code.
es_es: Se incluye la funcionalidad C<STORABLE_attach> añadida por Adam Kennedy, y menores requisitos de memoria estando bajo C<ithreads>, usando el código de seguimiento de clonación de C<ithreads>.

source: =item C<(?(condition)yes-pattern)>
es_es: =item C<(?(condición)patrón-sí)>

source: Note that Perl supports passing of up to only 14 arguments to your syscall, which in practice should (usually) suffice.
es_es: Tenga en cuenta que Perl soporta pasar sólo hasta 14 argumentos a su syscall, que en la práctica debería (generalmente) ser suficiente.

source: You may charge any fee you choose for support of this Package.
es_es: Usted puede reclamar un canon decidido por usted para el soporte de este Paquete.

source: For example, on 32-bit machines an integer may be represented by a sequence of 4 bytes, which will in Perl be presented as a string that's 4 characters long.
es_es: Por ejemplo, en máquinas de 32 bits, un entero puede ser representado por una secuencia de 4 bytes, que en Perl se presentará como una cadena de cuatro caracteres de longitud.

source: If you have cached your return value, then return a pointer to it without changing the reference count.
es_es: Si tiene cacheado su valor de retorno, entonces devuelva un puntero a él sin tener que cambiar el contador de referencias.

source: X<boolean> X<bool> X<true> X<false> X<truth>
es_es: X<boolean> X<bool> X<true> X<false> X<truth> X<booleano> X<verdadero> X<falso> X<verdad>

source: Note that using the v-strings for IPv4 addresses is not portable unless you also use the inet_aton()/inet_ntoa() routines of the Socket package.
es_es: Tenga en cuenta que el uso de v-strings para las direcciones IPv4 no es portable a menos que también utilice las rutinas del paquete Socket inet_aton()/inet_ntoa().

source: # Format number with up to 8 leading zeroes
es_es: # Formatea número con un máximo de 8 ceros iniciales

source: print $bar; # prints 30
es_es: print $bar; # pinta 30

source: In fact, the line marked "implicit deref" above works just fine--in this instance--to do what the one that says explicit deref did.
es_es: De hecho, la anterior línea marcada "desreferencia implícita" funciona muy bien -en este caso- para hacer lo mismo que hacía el de desreferencia explícita.

source: C<given> and C<when> are used in Perl to implement C<switch>/C<case> like statements.
es_es: C<given> y C<when> se utilizan en Perl para implementar instrucciones parecidas a C<switch>/C<case>.

source: =item unshift EXPR,LIST
es_es: =item unshift EXPR,LISTA

source: Now there's indeed something following "AB" that is not "123".
es_es: Ahora hay realmente algo después de "AB" que no es "123".

source: eval { unimplemented() };
es_es: eval { no_implementado() };

source: On ASCII platforms, the resulting characters from the list above are the complete set of ASCII controls.
es_es: En las plataformas ASCII, los caracteres resultantes de la lista anterior son el conjunto completo de los caracteres de control ASCII.

source: In Cygwin 1.5 the F<io/tell> and F<op/sysio> tests have failures for some yet unknown reason.
es_es: En Cygwin 1.5 las pruebas F<io/tell> y F<op/sysio> tienen fallas por alguna razón aún desconocida.

source: With that trick MakeMaker will only read the first line and thus read the underscore, while the perl interpreter will evaluate the $VERSION and convert the string into a number.
es_es: Con este truco MakeMaker sólo leerá la primera línea y, por tanto, leerá el guión bajo, mientras que el intérprete de perl evaluará la $VERSION y convertirá la cadena en un número.

source: unlink "alpha", "beta", "gamma"
es_es: unlink "alfa", "beta", "gamma"

source: This aspect of C<push> is considered highly experimental.
es_es: Este aspecto de C<push> es considerado altamente experimental.

source: select STDERR; $| = 1; # make unbuffered
es_es: select STDERR; $| = 1; # hacerlo sin búfer

source: By default, the "^" character is guaranteed to match only the beginning of the string, the "$" character only the end (or before the newline at the end), and Perl does certain optimizations with the assumption that the string contains only one line.
es_es: Por defecto, el carácter "^" garantiza que coincidirá solo con el principio de la cadena, el carácter "$" solo con el final (o antes del nueva línea del final) y Perl hará ciertas optimizaciones asumiendo que la cadena solo contiene una línea.

source: To sort a hash by value, you'll need to use a C<sort> function.
es_es: Para ordenar un hash por valor, necesitará usar la función C<sort>.

source: array => { description => "ordered list of items", sigil => '@', },
es_es: array => { descripcion => "lista ordenada de elementos", sigilo => '@', },

source: C<\p{}> did not imply Unicode rules, and neither did all occurrences of C<\N{}>, until 5.12.
es_es: C<\p{}> no implica reglas Unicode, y tampoco todas las apariciones de C<\N{}>, hasta 5.12.

source: v-strings as they currently exist are scheduled to be deprecated.
es_es: Los v-strings, tal como existen en la actualidad, está previsto que sean descartados.

source: # a bit exotic, that last one
es_es: # Un poco exótico, este último

source: X<regex, capture buffer> X<regexp, capture buffer> X<regex, capture group> X<regexp, capture group> X<regular expression, capture buffer> X<backreference> X<regular expression, capture group> X<backreference> X<\g{1}> X<\g{-1}> X<\g{name}> X<relative backreference> X<named backreference> X<named capture buffer> X<regular expression, named capture buffer> X<named capture group> X<regular expression, named capture group> X<%+> X<$+{name}> X<< \k<name> >> There is no limit to the number of captured substrings that you may use.
es_es: X<regex, búfer captura> X<regexp, búfer captura> X<regex, grupo captura> X<regexp, grupo captura> X<expresión regular, búfer captura> X<contrareferencia> X<expresión regular, grupo captura> X<\g{1}> X<\g{-1}> X<\g{nombre}> X<contrareferencia relativa> X<contrareferencia nombre> X<búfer captura nombre> X<expresión regular, búfer captura nombre> X<grupo captura nombre> X<expresión regular, grupo captura nombre> X<%+> X<$+{nombre}> X<< \k<nombre> >> No hay límite al número de subcadenas capturadas que puede usar.

source: Calls the System V IPC function semctl(2).
es_es: Llama a la función System V IPC semctl(2).

source: There is no need to do an interactive configure, just type
es_es: No hay necesidad de hacer un sistema interactivo para hacer la configuración, sólo tiene que escribir

source: A little interface to ExtUtils::Installed to examine installed modules, validate your packlists and even create a tarball from an installed module.
es_es: Esta utilidad ofrece una interfaz sencilla de ExtUtils::Installed, que permite examinar módulos instalados, validar las listas de paquetes e incluso crear un archivo de almacenamiento tar a partir de un módulo instalado.

source: Don't be tempted to write
es_es: No caiga en la tentación de escribir

source: Be descriptive (i.e. accurately describes the purpose of the module).
es_es: Sea descriptivo (es decir, describa con precisión el propósito del módulo).

source: End_Lines
es_es: Fin_Lineas

source: The purpose is to help you build Perl for UTS, which, if you follow these instructions, should be easy, and result in a solidly working installation.
es_es: El propósito es ayudar a construir Perl para UTS, que, si se siguen estas instrucciones, debería ser fácil, y el resultado ser una instalación sólida.

source: =head2 Bigger Numbers X<number, arbitrary precision>
es_es: =head2 Grandes números X<number, arbitrary precision> X<número, precisión arbitraria>

# print "5: got $1 " if $x =~ /^(D*)(?=d)(?!123)/;
source: print "5: got $1\n" if $x =~ /^(\D*)(?=\d)(?!123)/;
es_es: print "5: tenemos $1\n" if $x =~ /^(\D*)(?=\d)(?!123)/;

source: The private data cache will take ownership of a reference to private_sv, much the same way that C<hv_store()> takes ownership of a reference to the value that you pass it.
es_es: El caché privado de datos se apropiará de una referencia a private_sv, de la misma manera que C<hv_store()> toma la propiedad de una referencia al valor que usted le pasa.

source: The full dispatch table for the smart match operator is given in L<perlsyn/"Smart matching in detail">.
es_es: La tabla de combinaciones para el operador de coincidencia inteligente está en L<perlsyn/"Coincidencia inteligente en detalle">.

source: @articles = sort @files;
es_es: @articulos = sort @archivos;

source: (For example, see L<perlrebackslash/Octal escapes>.) Starting in Perl 5.14, you may use C<\o{}> instead, which avoids all these problems.
es_es: (Por ejemplo, vea L<perlrebackslash/Secuencias de escape octales>.) A partir de Perl v5.14, puede utilizar en su lugar C<\o{}>, toda vez que evita todos estos problemas.

source: =item C<m''>, the pattern of C<s'''>
es_es: =item C<m''>, y el patrón de C<s'''>

source: or:
es_es: o:

source: The return value C<LVALUE> indicates a reference to an lvalue that is not a variable.
es_es: El valor de retorno C<LVALUE> indica una referencia a un I<ivalor> (valor que se pone a la izquierda) que no es una variable.

source: Note that none of the above are supposed to write your code for you: asking questions about particular problems or general advice is fine, but asking someone to write your code for free is not very cool.
es_es: Tenga en cuenta que en ninguno de estos sitios van a hacer su trabajo; puede pedir consejo o hacer preguntas sobre problemas concretos, pero no espere que le escriban el código gratis.

source: [] anon.
es_es: [] ref. array

source: Remember the following important rule: There is B<no rule> that relates the behavior of an expression in list context to its behavior in scalar context, or vice versa.
es_es: Recuerde la siguiente regla importante: B<No hay regla> que relacione el comportamiento de una expresión en contexto lista a su comportamiento en contexto escalar, o viceversa.

source: hh interpret integer as C type "char" or "unsigned char"
es_es: hh interpreta un entero como un "char" o "unsigned char" del C

source: The array is given scalar context, and instead of using the 0th element of the array as the format, Perl will use the count of elements in the array as the format, which is almost never useful.
es_es: El array se le da en contexto escalar, y en lugar de utilizar el elemento 0 del array como el formato, Perl usará el número de elementos del array como el formato, que casi nunca es útil.

source: What you need to do is get a binary version of C<gcc> for your system first.
es_es: Lo primero que debe hacer es obtener una versión binaria de C<gcc> para su sistema.

source: Although the mostly deeply nested array or hash will not spring into existence just because its existence was tested, any intervening ones will.
es_es: Aunque el array o hash más profundamente anidado no se autovivifique sólo por que su existencia sea comprobada, cualquiera de los niveles intermedios sí que lo hará.

source: If it is supported it usually encodes some administrative comment about the user.
es_es: Si está soportado usualmente codifica algún comentario administrativo sobre el usuario.

source: You certainly won't be chastised if you don't trust nuclear-plant or brain-surgery monitoring code to it.
es_es: Nadie le reprochará que no lo utilice para desarrollar código de control de centrales nucleares o neurocirugía.

source: lowercase line-noise MiXeD line-noise.
es_es: minúsculas línea-ruido MeZcLaDoS línea-ruido.

source: or the loop implied by split().
es_es: o el bucle implícito de split().

source: was misleading because the "other" included also the thread giving the warning.
es_es: era engañoso, porque los "otros" incluían también al hilo que daba la advertencia.

source: Will raise an exception if used on a machine that doesn't implement getpgrp(2).
es_es: Elevará una excepción si se usa en una máquina que no implemente getpgrp(2).

source: $sb = stat($filename);
es_es: $sb = stat($archivo);

source: # sort using explicit subroutine name
es_es: # ordena usando un nombre de una subrutina explícita

source: Sequence Note Description
es_es: Secuencia Nota Descripción

source: Note that since Perl 5.8.1 the single-number v-strings (like C) are not v-strings before the C<< => >> operator (which is usually used to separate a hash key from a hash value); instead they are interpreted as literal strings ('v65').
es_es: Tenga en cuenta que desde Perl 5.8.1 los v-string de un solo número (como C) no son v-strings delante del operador C<< => >> (que se utiliza normalmente para separar una clave hash de un valor hash), sino que se interpretan como cadenas literales ('v65').

source: The value of EXPR indicates how many call frames to go back before the current one.
es_es: El valor de EXPR indica cuántos marcos de llamada se ha de retroceder antes del actual.

source: Yet another cross-compilation option has been added: now Perl builds on OpenZaurus, an Linux distribution based on Mandrake + Embedix for the Sharp Zaurus PDA.
es_es: Se ha agregado otra opción de compilación cruzada: ahora Perl se compila en OpenZaurus, una distribución Linux basada en Mandrake + Embedix para la PDA Sharp Zaurus.

source: The pain was intensified by the Unicode implementation of Perl 5.8.0 (still) having nasty bugs, especially related to the use of s/// and tr///.
es_es: El dolor se intensificó por que la implementación de Unicode de Perl 5.8.0 (todavía) tenía errores desagradables, especialmente en relación con el uso de s// y tr///.

source: Binary "lt" returns true if the left argument is stringwise less than the right argument.
es_es: Binario "lt" devuelve verdadero si el argumento de la izquierda es alfanuméricamente menor que el argumento de la derecha.

source: Returns the length in I<characters> of the value of EXPR.
es_es: Devuelve la longitud en I<caracteres> del valor de EXPR.

source: (EXPR should be positive.) If EXPR is omitted, the value C<1> is used.
es_es: (EXPR debe ser positiva). Si EXPR se omite, se usa el valor C<1>.

source: See L</Capture groups> below for details.
es_es: Vea más abajo L</Búfer de captura> para más detalles.

source: Tolkien quotes at the head of C source file have been checked and proper citations added, thanks to a patch from Tom Christiansen.
es_es: Tolkien al principio del archivo fuente en C han sido verificadas y añadido referencias apropiadas, gracias a un parche de Tom Christiansen.

# Backslashed metacharacters in Perl are alphanumeric, such as C<b>, C<w>, C< >.
source: Backslashed metacharacters in Perl are alphanumeric, such as C<\b>, C<\w>, C<\n>.
es_es: Metacaracteres escapados en Perl son alfanuméricos, como C<\b>, C<\w>, C<\n>.

source: 5.005-style threads (activated by C<use Thread;>) were deprecated in Perl 5.8.0 and will be removed after Perl 5.8, see L<perl58delta> for details.
es_es: Los I<threads> estilo 5.005 (activados con C<use Thread;>) fueron desaprobados en Perl 5.8.0 y serán eliminados después de Perl 5.8, vea L<perl58delta> para más detalles.

source: Probably the best thing to do is try to write equivalent code to do a set of tasks.
es_es: Probablemente lo mejor sea escribir código equivalente para realizar una serie de tareas.

source: Throughout the previous section all the examples have used the syntax:
es_es: En todos los ejemplos de la sección anterior se utilizó esta sintaxis:

source: In addition to minor cleanup of questionable expressions in F<vms.c>, file permissions should no longer be garbled by the PerlIO layer, and spurious record boundaries should no longer be introduced by the PerlIO layer during output.
es_es: Además de una limpieza de menor importancia de cuestionables expresiones en F<vms.c>, los permisos de archivo ya no deberían ser distorsionados por la capa PerlIO, y los espurios límites de registro ya no deberían ser introducidos por la capa PerlIO durante la salida.

source: In IRIX 5.3 and with Perl 5.8.1 (Perl 5.8.0 didn't compile in IRIX 5.3) the following failures are known.
es_es: En IRIX 5.3 y con Perl 5.8.1 (Perl 5.8.0 no compila en IRIX 5.3) se conocen los siguientes errores.

source: The values are returned in an apparently random order.
es_es: Los valores son devueltos en un aparente orden aleatorio.

source: A few of these are good, some are OK, but many aren't worth your money.
es_es: Algunos son buenos y otros aceptables, pero muchos no merecen la pena.

source: Like C<exec>, C<system> allows you to lie to a program about its name if you use the C<system PROGRAM LIST> syntax.
es_es: Al igual que C<exec>, C<system> permite reposar a un programa bajo un nombre, si se utiliza la sintaxis C<system PROGRAMA LISTA>.

source: Assignment to a scalar evaluates the right-hand side in scalar context, while assignment to an array or hash evaluates the righthand side in list context.
es_es: La asignación a un escalar evalúa lo que hay en el lado derecho en contexto escalar, mientras que la asignación a un array o a un hash evalúa el lado derecho en contexto de lista.

source: If the $quota is unsupported, it is an empty scalar.
es_es: Si la $cuota no está soportada, es un escalar vacío.
